ali.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-15 Wed 15:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>阿里C++研发工程师实习(淘系技术)</title>
<meta name="author" content="于承业" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="latexcss/latexcss.css" />
<link rel="stylesheet" type="text/css" href="../latexcss/latexcss.css" />
<link rel="alternate stylesheet" type="https://orgmode.org/resources/style/org-demo.min.css" />
<link rel="alternate stylesheet" type="../latexcss/latexcss.css" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">阿里C++研发工程师实习(淘系技术)</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org14bb4fc">1. 一面</a>
<ul>
<li><a href="#org2b1020b">1.1. <span class="done DONE">DONE</span> 已通过</a></li>
<li><a href="#org680c183">1.2. 总体感受</a></li>
<li><a href="#org12a1867">1.3. 项目</a></li>
<li><a href="#org0d02d12">1.4. 基础知识</a>
<ul>
<li><a href="#org3256462">1.4.1. C++</a></li>
<li><a href="#org280b4d9">1.4.2. 计网</a></li>
<li><a href="#orga8c53cb">1.4.3. OS</a></li>
</ul>
</li>
<li><a href="#org8d38970">1.5. 算法题</a></li>
<li><a href="#org5f366e9">1.6. 反问</a></li>
</ul>
</li>
<li><a href="#org37dd7a5">2. <span class="done DONE">DONE</span> 二面</a>
<ul>
<li><a href="#org3df4154">2.1. 自我介绍</a></li>
<li><a href="#orge662825">2.2. 项目</a>
<ul>
<li><a href="#orgdc64516">2.2.1. 协程库</a></li>
</ul>
</li>
<li><a href="#org5db3ef3">2.3. 反问</a></li>
</ul>
</li>
<li><a href="#org0c926b5">3. 总结</a></li>
<li><a href="#orgc9443a0">4. <span class="done DONE">DONE</span> HR面</a></li>
<li><a href="#org3bea5d9">5. <span class="done DONE">DONE</span> 交叉面</a></li>
</ul>
</div>
</div>
<p>
<a href="./index.html">Back to index</a>
</p>

<div id="outline-container-org14bb4fc" class="outline-2">
<h2 id="org14bb4fc"><span class="section-number-2">1.</span> 一面</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org2b1020b" class="outline-3">
<h3 id="org2b1020b"><span class="section-number-3">1.1.</span> <span class="done DONE">DONE</span> 已通过</h3>
<div class="outline-text-3" id="text-1-1">
<p>
CLOSED: <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-03-15 Tue&gt; </span></span> ~ 1hour
</p>

<p>
感谢面试官
</p>
</div>
</div>

<div id="outline-container-org680c183" class="outline-3">
<h3 id="org680c183"><span class="section-number-3">1.2.</span> 总体感受</h3>
<div class="outline-text-3" id="text-1-2">
<p>
面我的面试官比较注重学习历程。
</p>

<p>
里面有些问题我讲了很多，然后自己往外拓展了很多，再加上前面我结合项目说心得说了很多，导致面试官没问多少问题。
</p>
</div>
</div>

<div id="outline-container-org12a1867" class="outline-3">
<h3 id="org12a1867"><span class="section-number-3">1.3.</span> 项目</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li>你对编程有啥理解？</li>
<li>拿你的一个项目为例，你有什么和编程相关的心得，有没有和软件工程有关的心得？（版本控制、规范注释、谷歌C++代码规范等等）（讲了很多，感觉面试官比较满意）</li>
<li>你是怎么校正倾斜文字的？（Hough变换和Radon变换）</li>
<li>印象最深的项目</li>
</ol>
</div>
</div>

<div id="outline-container-org0d02d12" class="outline-3">
<h3 id="org0d02d12"><span class="section-number-3">1.4.</span> 基础知识</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-org3256462" class="outline-4">
<h4 id="org3256462"><span class="section-number-4">1.4.1.</span> C++</h4>
<div class="outline-text-4" id="text-1-4-1">
<ol class="org-ol">
<li>new/delete和malloc/free的区别</li>
<li>一个类A有两个int型数据成员，还有两个成员函数，sizeof(A)是多少？</li>
<li>如果两个数据成员声明为static呢？</li>
<li>如果两个成员函数是虚函数呢？</li>
<li>类B继承类A，B自己有个int型数据成员，sizeof(B)？（内存对齐）</li>
<li>C和C++的区别</li>
<li>智能指针</li>
</ol>
</div>
</div>

<div id="outline-container-org280b4d9" class="outline-4">
<h4 id="org280b4d9"><span class="section-number-4">1.4.2.</span> 计网</h4>
<div class="outline-text-4" id="text-1-4-2">
<ol class="org-ol">
<li>TCP/UDP区别</li>
<li>DNS是啥</li>
</ol>
</div>
</div>

<div id="outline-container-orga8c53cb" class="outline-4">
<h4 id="orga8c53cb"><span class="section-number-4">1.4.3.</span> OS</h4>
<div class="outline-text-4" id="text-1-4-3">
<ol class="org-ol">
<li>线程和协程</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org8d38970" class="outline-3">
<h3 id="org8d38970"><span class="section-number-3">1.5.</span> 算法题</h3>
<div class="outline-text-3" id="text-1-5">
<p>
1.找出两个数组里的相同数字，可重复（unordered_map）
</p>
</div>
</div>

<div id="outline-container-org5f366e9" class="outline-3">
<h3 id="org5f366e9"><span class="section-number-3">1.6.</span> 反问</h3>
<div class="outline-text-3" id="text-1-6">
<ol class="org-ol">
<li>面试表现</li>
<li>C++工程师实习岗位，具体干什么</li>
<li>是否有转正机会</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-org37dd7a5" class="outline-2">
<h2 id="org37dd7a5"><span class="section-number-2">2.</span> <span class="done DONE">DONE</span> 二面</h2>
<div class="outline-text-2" id="text-2">
<p>
CLOSED: <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-03-28 Mon&gt;</span></span>
</p>

<p>
一二面相隔时间较长是因为我一开始没做笔试直接一面，一面通过的第二天通知的，必须完成笔试才能安排二面，因此等了一个多周。
</p>
</div>

<div id="outline-container-org3df4154" class="outline-3">
<h3 id="org3df4154"><span class="section-number-3">2.1.</span> 自我介绍</h3>
</div>

<div id="outline-container-orge662825" class="outline-3">
<h3 id="orge662825"><span class="section-number-3">2.2.</span> 项目</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-orgdc64516" class="outline-4">
<h4 id="orgdc64516"><span class="section-number-4">2.2.1.</span> 协程库</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
对着代码提问和回答。面试官提到了注释（docString）的书写。着重问了有栈协程的内联汇编部分的代码（保存寄存器、切换栈指针、恢复寄存器）、独立栈的保存位置、和操作系统分配的栈的关系。
无栈协程是如何实现的。
然后问了感想和收获。
</p>
</div>
</div>
</div>

<div id="outline-container-org5db3ef3" class="outline-3">
<h3 id="org5db3ef3"><span class="section-number-3">2.3.</span> 反问</h3>
<div class="outline-text-3" id="text-2-3">
<p>
总结下来，面试官说通过对项目细节的提问，能看出设计和工程方面的能力，也能反应代码水平。
</p>
</div>
</div>
</div>

<div id="outline-container-org0c926b5" class="outline-2">
<h2 id="org0c926b5"><span class="section-number-2">3.</span> 总结</h2>
<div class="outline-text-2" id="text-3">
<p>
不知道阿里其它部门的其它岗位怎么样，我面试的是淘系C++研发工程师，感觉非常看重软件工程的实践能力，也就是项目。项目要有技术点，适当复杂一些，要能体现出你的学习能力和编码能力。
</p>

<p>
面试官说没有技术面了，如果通过下轮就是HR面。
</p>
</div>
</div>


<div id="outline-container-orgc9443a0" class="outline-2">
<h2 id="orgc9443a0"><span class="section-number-2">4.</span> <span class="done DONE">DONE</span> HR面</h2>
<div class="outline-text-2" id="text-4">
<p>
SCHEDULED: <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-04-01 Fri&gt;</span></span>
</p>

<p>
主要问了在校经历，反问问了实习期和转正相关的。总共7min。听他们说有可能是HR想挂你，否则不会只面7min且很着急地第二天安排加面，猜测理由是HC不足。因为二面面试官告诉我，他和一面面试官的面评都不错。
</p>
</div>
</div>

<div id="outline-container-org3bea5d9" class="outline-2">
<h2 id="org3bea5d9"><span class="section-number-2">5.</span> <span class="done DONE">DONE</span> 交叉面</h2>
<div class="outline-text-2" id="text-5">
<p>
SCHEDULED: <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-04-02 Sat&gt;</span></span>
</p>

<p>
面试官一看就是大佬，后来谷歌了下是淘系P9。
</p>

<p>
让我介绍项目然后他会提问，然后问了些C++基础知识，会问应用场景，感觉比前两面难。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 于承业</p>
<p class="date">Created: 2023-03-15 Wed 15:28</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
